In [1]:
# Ambientando um HelloWorld

print ("Hello World")

Hello World

# SqlAlchemy é uma bibliotexa de ORM

- Conexão facil
- Mapeamento de Tabela com Classe (ORM)
- Resolve um conflito de tecnologias com paradigmas diferentes.
- tudo fique orientado a objetos

In [4]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\python\projetofinalnotbook\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\python\projetofinalnotbook\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\python\projetofinalnotbook\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

In [5]:
! pip install pymysql

Collecting pymysql
  Using cached PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Using cached PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [4]:
import pandas as pd

In [5]:
from sqlalchemy import create_engine

In [6]:
import pymysql

## Senha?

- user = "root"
- password = "senai@123"
- host = "localhost"
- database = "projetodiario1"

In [7]:
#biblioteca para converter e resolver problema do @

import urllib.parse

user = "root"
password = urllib.parse.quote_plus("senai@123")

# Qual o host e o banco?


host = "localhost"
database = "projetodiario1"


# conecction_string : string com TODAS as informaçoes da conexão
connection_string = f"mysql+pymysql://{user}:{password}@{host}/{database}"

# criando a conexao 
engine =  create_engine(connection_string)

# escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno "

#Criar um DataFrame com a consulta SQL

df_alunos = pd.read_sql(query_alunos,engine)
df_alunos

    id        ra            Nome  tempoestudo  rendafamiliar
0    1  00000001            None            0            NaN
1    2  00000002            None            0            NaN
2    3  00000003            None            0            NaN
3    4  00000004            None            0            NaN
4    5  00000005            None            0            NaN
..  ..       ...             ...          ...            ...
70  71  00000071  Renato Ribeiro           12         4600.0
71  72  00000072  Juliana Santos            9         4700.0
72  73  00000073  Gustavo Araújo            8         4800.0
73  74  00000074    Camila Pires            7         4900.0
74  75  00000075   Daniela Nunes           10         5000.0

[75 rows x 5 columns]

# Bibliotecas para DATA Science

- Pandas (EDA - Analise Exploratoria de Dados)
- Scikit-Learn (Fundamentos de Inteligencia Artificial )
- NumPy (Matematica completa com abstração)

# Salvando o DataFrame

- .csv
- .xlsx
- .jason
- .sql
- .html
- .xml

In [8]:
cvs_filename = "alunos.csv"
df_alunos.to_csv(cvs_filename,index=False)

Crie uma nova celular que salva o dataframe no formato JSON

In [9]:
filename_jason = "alunos.json"
df_alunos.to_json(filename_jason,index=False)

# Um novo DataFrame

In [10]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [11]:
df_tempo_renda = df_alunos[["tempoestudo","rendafamiliar"]]

In [12]:
df_tempo_renda

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
70           12         4600.0
71            9         4700.0
72            8         4800.0
73            7         4900.0
74           10         5000.0

[75 rows x 2 columns]

In [13]:
type(df_tempo_renda)

pandas.core.frame.DataFrame

In [14]:
len(df_alunos)

75

In [19]:
df_alunos[0:30]

    id        ra              Nome  tempoestudo  rendafamiliar
0    1  00000001              None            0            NaN
1    2  00000002              None            0            NaN
2    3  00000003              None            0            NaN
3    4  00000004              None            0            NaN
4    5  00000005              None            0            NaN
5    6  00000006              None            0            NaN
6    7  00000007              None            0            NaN
7    8  00000008              None            0            NaN
8    9  00000009              None            0            NaN
9   10  00000010              None            0            NaN
10  11  00000011              None            0            NaN
11  12  00000012              None            0            NaN
12  13  00000013              None            0            NaN
13  14  00000014              None            0            NaN
14  15  00000015              None            0            NaN
15  16  00000016              None            0            NaN
16  17  00000017              None            0            NaN
17  18  00000018              None            0            NaN
18  19  00000019              None            0            NaN
19  20  00000020              None            0            NaN
20  21  00000021              None            0            NaN
21  22  00000022              None            0            NaN
22  23  00000023              None            0            NaN
23  24  00000024              None            0            NaN
24  25  00000025              None            0            NaN
25  26  00000026     Marcelo Silva           11         3100.0
26  27  00000027     Elaine Santos           10         2900.0
27  28  00000028     Roberto Souza            8         2800.0
28  29  00000029      Tatiana Lima            7         2500.0
29  30  00000030  Gustavo Oliveira           12         3200.0

In [20]:
renda_familiar = df_alunos[["tempoestudo","rendafamiliar"]]
type(renda_familiar)

pandas.core.frame.DataFrame

In [21]:
renda_familiar

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
70           12         4600.0
71            9         4700.0
72            8         4800.0
73            7         4900.0
74           10         5000.0

[75 rows x 2 columns]

In [22]:
df_alunos

    id        ra            Nome  tempoestudo  rendafamiliar
0    1  00000001            None            0            NaN
1    2  00000002            None            0            NaN
2    3  00000003            None            0            NaN
3    4  00000004            None            0            NaN
4    5  00000005            None            0            NaN
..  ..       ...             ...          ...            ...
70  71  00000071  Renato Ribeiro           12         4600.0
71  72  00000072  Juliana Santos            9         4700.0
72  73  00000073  Gustavo Araújo            8         4800.0
73  74  00000074    Camila Pires            7         4900.0
74  75  00000075   Daniela Nunes           10         5000.0

[75 rows x 5 columns]

In [23]:
df_alunos.head(2)

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  00000001  None            0            NaN
1   2  00000002  None            0            NaN

In [24]:
df_alunos[0:2]

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  00000001  None            0            NaN
1   2  00000002  None            0            NaN

In [25]:
df_alunos.iloc[0:2]

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  00000001  None            0            NaN
1   2  00000002  None            0            NaN

In [26]:
df_alunos.tail(2)

    id        ra           Nome  tempoestudo  rendafamiliar
73  74  00000074   Camila Pires            7         4900.0
74  75  00000075  Daniela Nunes           10         5000.0

In [27]:
df_alunos.iloc[-2:]

    id        ra           Nome  tempoestudo  rendafamiliar
73  74  00000074   Camila Pires            7         4900.0
74  75  00000075  Daniela Nunes           10         5000.0

In [28]:
df_alunos.shape

(75, 5)

In [29]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [30]:
query_diariobordo = 'SELECT * FROM diariobordo'
df_diariobordo = pd.read_sql(query_diariobordo, engine)
df_diariobordo

   id                   texto            datahora  fk_aluno_id
0   1  Aula de banco de dados 2024-08-01 09:16:00            1

In [31]:
query_avaliacao = 'SELECT * FROM avaliacao'
df_avaliacao = pd.read_sql(query_avaliacao, engine)
df_avaliacao

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     10      9      8     10            2
1   2      9     10      7      9            4
2   3      8      8      7      6            5
3   4      9      9      7      9            6
4   5      9     10      5     10            7